Repository: Centaurioun/MSIX-Hero
Catalog: src/Otor.MsixHero.Appx.Editor/Resources/Localization.*.resx
Languages: de, pl

# AppxEditor_Error_CommandNotSupported_Format
source: The command '{0}' is not supported.
de: Der Befehl '{0}' wird nicht unterstützt.
pl: Komenda '{0}' nie jest wspierana.

# AppxEditor_Error_CustomCapabilityLength_Format
source: The name of a custom capability must be longer than {2} characters. Capability '{0}' has only {1} characters.
de: Der Name einer benutzerdefinierten Capability muss länger als {2} Zeichen sein. Capability '{0}' hat nur {1} Zeichen.
pl: Nazwa zastrzeżonego uprawnienia musi być dłuższa niż {2} znaków. Uprawnienie '{0}' ma jedynie {1} znaków.

# AppxEditor_Error_EmptyRoot
source: Document root cannot be empty.
de: Der Root des Dokuments darf nicht leer sein.
pl: Główny element pliku XML jest wymagany.

# AppxEditor_Error_FileMissing_Format
source: File '{0}' does not exist.
de: Die Datei '{0}' existiert nicht.
pl: Plik '{0}' nie istnieje.

# AppxEditor_Error_HiveNotSupported_Format
source: Registry hive {0} is not supported.
de: Registry Hive {0} wird nicht unterstützt.
pl: Gałąź rejestru {0} nie jest wspierana.

# AppxEditor_Error_ManifestCannotBeRemoved
source: Manifest file cannot be removed.
de: Die Manifestdatei kann nicht entfernt werden.
pl: Plik manifestu nie może być usuwany.

# AppxEditor_Error_ManifestNotFound_Format
source: Manifest file not found in '{0}'.
de: Manifestdatei nicht gefunden in '{0}'.
pl: Nie odnaleziono pliku manifestu w {0}.

# AppxEditor_Error_NotAVersion_Format
source: The value '{0}' is not a valid version string.
de: Der Wert '{0}' ist keine gültige Versionsnummer.
pl: Wartość '{0}' nie jest poprawnym formatem wersji.

# AppxEditor_Error_PathNoRegFile
source: The path must be a registry path.
de: Der Pfad muss ein Registry-Pfad sein.
pl: Ścieżka musi wskazywać na plik rejestru.

# AppxEditor_Files_Copy_Format
source: Copying file from '{0}' to '{1}'…
de: Kopieren der Datei von '{0}' nach '{1}'...
pl: Kopiowanie pliku '{0}' do '{1}'…

# AppxEditor_Identity_ChangingArchitecture_Format
source: Changing attribute 'ProcessorArchitecture' from '{0}' to '{1}'…
de: Setzen des Attributs 'ProcessorArchitecture' von '{0}' auf '{1}'...
pl: Zmiana atrybutu 'ProcessorArchitecture' z '{0}' na '{1}'…

# AppxEditor_Identity_ChangingName_Format
source: Changing attribute 'Name' from '{0}' to '{1}'…
de: Ändern des Attributs 'Name' von '{0}' auf '{1}'...
pl: Zmiana atrybutu 'Name' z '{0}' na '{1}'…

# AppxEditor_Identity_ChangingPublisher_Format
source: Changing attribute 'Publisher' from '{0}' to '{1}'…
de: Ändern des Attributs 'Publisher' von '{0}' auf '{1}'...
pl: Zmiana atrybutu 'Publisher' z '{0}' na '{1}'…

# AppxEditor_Identity_ChangingResourceId_Format
source: Changing attribute 'ResourceId' from '{0}' to '{1}'…
de: Ändern des Attributs 'ResourceId' von '{0}' auf '{1}'...
pl: Zmiana atrybutu 'ResourceId' z '{0}' na '{1}'…

# AppxEditor_Identity_ChangingVersion_Format
source: Changing attribute 'Version' from '{0}' to '{1}'…
de: Ändern des Attributs 'Version' von '{0}' auf '{1}'...
pl: Zmiana atrybutu 'Version' z '{0}' na '{1}'…

# AppxEditor_Identity_SettingArchitecture_Format
source: Setting attribute 'ProcessorArchitecture' to '{0}'…
de: Setzen des Attributs 'ProcessorArchitecture' auf '{0}'...
pl: Ustawianie atrybutu 'ProcessorArchitecture' na '{0}'…

# AppxEditor_Identity_SettingName_Format
source: Setting attribute 'Name' to '{0}'…
de: Setzen des Attributs 'Name' auf '{0}'...
pl: Ustawianie atrybutu 'Name' na '{0}'…

# AppxEditor_Identity_SettingPublisher_Format
source: Setting attribute 'Publisher' to '{0}'…
de: Setzen des Attributs 'Publisher' auf '{0}'...
pl: Ustawianie atrybutu 'Publisher' na '{0}'…

# AppxEditor_Identity_SettingResourceId_Format
source: Setting attribute 'ResourceId' to '{0}'…
de: Setzen des Attributs 'ResourceId' auf '{0}'...
pl: Ustawianie atrybutu 'ResourceId' na '{0}'…

# AppxEditor_Identity_SettingVersion_Format
source: Setting attribute 'Version' to '{0}'…
de: Setzen des Attributs 'Version' auf '{0}'...
pl: Ustawianie atrybutu 'Version' na '{0}'…

# AppxEditor_Properties_ChangingDescription_Format
source: Changing attribute 'Description' from '{0}' to '{1}'…
de: Ändern des Attributs 'Description' von '{0}' auf '{1}'...
pl: Zmiana atrybutu 'Description' z '{0}' na '{1}'…

# AppxEditor_Properties_ChangingDisplayName_Format
source: Changing attribute 'DisplayName' from '{0}' to '{1}'…
de: Ändern des Attributs 'DisplayName' von '{0}' auf '{1}'...
pl: Zmiana atrybutu 'DisplayName' z '{0}' na '{1}'…

# AppxEditor_Properties_ChangingLogo_Format
source: Changing attribute 'Logo' from '{0}' to '{1}'…
de: Ändern des Attributs 'Logo' von '{0}' auf '{1}'...
pl: Zmiana atrybutu 'Logo' z '{0}' na '{1}'…

# AppxEditor_Properties_ChangingModPackTrue_Format
source: Changing property 'ModificationPackage' from '{0}' to 'true'…
de: Ändern der Eigenschaft 'ModificationPackage' von '{0}' auf 'true'...
pl: Zmiana atrybutu 'ModificationPackage' z '{0}' na 'true'…

# AppxEditor_Properties_ChangingPublisherDisplayName_Format
source: Changing attribute 'PublisherDisplayName' from '{0}' to '{1}'…
de: Ändern des Attributs 'PublisherDisplayName' von '{0}' auf '{1}'...
pl: Zmiana atrybutu 'PublisherDisplayName' z '{0}' na '{1}'…

# AppxEditor_Properties_RemovingModPack
source: Removing property 'ModificationPackage'…
de: Entfernen der Eigenschaft 'ModificationPackage'...
pl: Usuwanie właściwości 'ModificationPackage'…

# AppxEditor_Properties_SettingDescription_Format
source: Setting property 'Description' to '{0}'…
de: Setzen des Attributs 'Description' auf '{0}'...
pl: Ustawianie atrybutu 'Description' na '{0}'…

# AppxEditor_Properties_SettingDisplayName_Format
source: Setting attribute 'DisplayName' to '{0}'…
de: Setzen des Attributs 'DisplayName' auf '{0}'...
pl: Ustawianie atrybutu 'DisplayName' na '{0}'…

# AppxEditor_Properties_SettingLogo_Format
source: Setting attribute 'Logo' to '{0}'…
de: Setzen des Attributs 'Logo' auf '{0}'...
pl: Ustawianie atrybutu 'Logo' na '{0}'…

# AppxEditor_Properties_SettingModPackTrue
source: Setting property 'ModificationPackage' to 'true'…
de: Setzen der Eigenschaft 'ModificationPackage' auf 'true'...
pl: Ustawianie atrybutu 'ModificationPackage' na 'true'…

# AppxEditor_Properties_SettingPublisherDisplayName_Format
source: Setting attribute 'PublisherDisplayName' to '{0}'…
de: Setzen des Attributs 'PublisherDisplayName' auf '{0}'...
pl: Ustawianie atrybutu 'PublisherDisplayName' na '{0}'…

# AppxEditor_Registry_ImportingRegFile_Format
source: Importing registry file '{0}'…
de: Importieren der Registry-Datei '{0}'...
pl: Importowanie pliku rejestru {0}…

# AppxEditor_Registry_ImportSuccess
source: Registry key has been successfully imported.
de: Der Registry-Schlüssel wurde erfolgreich importiert.
pl: Plik rejestru został pomyślnie zaimportowany

# AppxEditor_Registry_RegKeySet_Format
source: Registry key '{0}\{1}' has been set.
de: Der Registry-Schlüssel '{0}\{1}' wurde gesetzt.
pl: Klucz rejestru '{0}\{1}' został ustawiony.

# AppxEditor_Registry_RegValueSet_Format
source: Registry value '{0}' = '{1}' ({3}) has been set in '{4}\{5}
de: Der Registry-Wert '{0}' = '{1}' ({3}) wurde in '{4}\{5}' gesetzt.
pl: Wartość rejestru '{0}' = '{1}' ({3}) została ustawiona w kluczu rejestru '{4}\{5}

# AppxEditor_Registry_RemovingKey_Format
source: Removing registry key '{0}\{1}'…
de: Entfernen des Registry-Schlüssels '{0}\{1}'...
pl: Usuwanie klucza rejestru '{0}\{1}'…

# AppxEditor_Registry_RemovingValue_Format
source: Removing value '{0}' from key '{1}\{2}'…
de: Entfernen des Wertes '{0}' aus dem Schlüssel '{1}\{2}'...
pl: Usuwanie wartości '{0}' z klucza rejestru '{1}\{2}'.

# AppxEditor_Warn_CapabilityExists_Format
source: The capability '{0}' already exists and will not be added again.
de: Die Capability '{0}' existiert bereits und wird nicht erneut hinzugefügt.
pl: Uprawnienie '{0}' już istnieje i nie zostanie dodane ponownie.

# AppxEditor_Warn_FileCouldNotRemove_Format
source: File '{0}' could not be removed ({1}).
de: Die Datei '{0}' konnte nicht entfernt werden ({1}).
pl: Plik '{0}' nie mógł zostać usunięty ({1}).

# AppxEditor_Warn_FilePath_PartMissing_Format
source: Part of the path '{0}' does not exist.
de: Ein Teil des Pfades '{0}' existiert nicht.
pl: Część ścieżki do pliku '{0}' nie istnieje.

# AppxEditor_Warn_NoChangesDueToMissingKey_Format
source: No changes have been applied. Registry key '{0}\{1}' does not exist.
de: Es wurden keine Änderungen vorgenommen. Der Registrierungsschlüssel '{0}\{1}' existiert nicht.
pl: Nie dokonano zmian. Klucz rejestru '{0}\{1}' nie istnieje.

# AppxEditor_Warn_NoFileRemoved
source: No files have been removed.
de: Es wurden keine Dateien entfernt.
pl: Żaden plik nie został usunięty.

# AppxEditor_Warn_NothingImported
source: No new entries have been imported.
de: Es wurden keine neuen Einträge importiert.
pl: Nie zaimportowano żadnych nowych wpisów.

# Validation_Appx_CannotEndWithDot
source: The value cannot end with dot.
de: Der Wert darf nicht mit einem Punkt enden.
pl: Wartość nie może kończyć się kropką.

# Validation_Appx_PackageName_Empty
source: The package name cannot be empty.
de: Der Paketname darf nicht leer sein.
pl: Nazwa pakietu nie może być pusta.

# Validation_Appx_PackageName_WrongChars
source: The package name must consist of alpha-numeric, period and dash characters.
de: Der Paketname muss aus alphanumerischen Zeichen, Punkt und Bindestrich bestehen.
pl: Nazwa pakietu zasobu musi składać się wyłącznie ze znaków alfanumerycznych, kropek i kresek.

# Validation_Appx_PackageName_WrongLength
source: The package name must be a string between 3 and 50 characters in length.
de: Der Paketname muss zwischen 3 und 50 Zeichen haben
pl: Nazwa pakietu musi być łańcuchem znaków, o długości pomiędzy 3 a 50.

# Validation_Appx_Publisher_Empty
source: The publisher cannot be empty.
de: Der Herausgeber darf nicht leer sein.
pl: Wydawca nie może być pusty.

# Validation_Appx_Publisher_InvalidFormat
source: Publisher name must be a valid DN string (for example CN=Author)
de: Der Name des Herausgebers muss eine gültige DN-Zeichenfolge sein (z. B. CN=Herausgeber)
pl: Wydawca musi być poprawnym ciągiem znaków, reprezentującym nazwę unikalną (np. CN=Autor)

# Validation_Appx_ResourceId_Empty
source: The resource ID cannot be empty.
de: Die Ressourcen-ID darf nicht leer sein.
pl: Identyfikator zasobu nie może być pusty.

# Validation_Appx_ResourceId_WrongChars
source: The resource ID must consist of alpha-numeric, period and dash characters.
de: Die Ressourcen-ID muss aus alphanumerischen Zeichen, Punkt und Bindestrich bestehen.
pl: Identyfikator zasobu musi składać się wyłącznie ze znaków alfanumerycznych, kropek i kresek.

# Validation_Appx_ResourceId_WrongLength
source: The resource ID must be a string between 1 and 30 characters in length.
de: Die Ressourcen-ID muss zwischen 1 und 30 Zeichen haben.
pl: Identyfikator zasobu musi być łańcuchem znaków, o długości pomiędzy 1 a 30.

# Validation_Appx_RestrictedPrefix
source: The value '{1}' starts with a restricted prefix '{0}'.
de: Der Wert "{1}" beginnt mit einem verbotenen Präfix "{0}".
pl: Wartość '{1}' zaczyna się od zastrzeżonego przedrostka '{0}'.

# Validation_Appx_RestrictedValue
source: The value '{0}' is a restricted name and cannot be used.
de: Der Wert '{0}' ist ein verbotener Name und kann nicht verwendet werden.
pl: Wartość '{0}' jest zastrzeżone i nie może zostać użyta.

# Validation_Appx_RestrictedXnString
source: The value '{0}' contains a restricted string '.xn--'.
de: Der Wert "{0}" enthält eine verbotene Zeichenfolge ".xn--".
pl: Wartość '{0}' zawiera zastrzeżony łańcuch znaków '.xn--'.

# Validation_Appx_Version_Empty
source: The version cannot be empty.
de: Die Version darf nicht leer sein.
pl: Wersja nie może być pusta.

# Validation_Appx_Version_InvalidFormat
source: The version must be in format #.#.#.#.
de: Die Version muss im Format #.#.#.#.# angegeben werden.
pl: Wersja musi być podana w formacie #.#.#.#.
