Repository: Centaurioun/MSIX-Hero
Catalog: src/Otor.MsixHero.Infrastructure/Resources/Localization.*.resx
Languages: de, pl

# Infrastructure_Error_CouldNotOpenFile_Format
source: Could not open the file {0}.
de: Die Datei {0} konnte nicht geöffnet werden.
pl: Otwieranie pliku {0} nie powiodło się.

# Infrastructure_Hashing_Format
source: Calculating hash {0}%…
de: Berechnung von Hash {0}%...
pl: Obliczanie sumy kontrolnej {0}%…

# Infrastructure_Ipc_CreatingNamedPipeFor_Format
source: Creating named pipe for {0}…
de: Named Pipe für {0} wird erstellt...
pl: Tworzenia nazwanego potoku dla {0}…

# Infrastructure_Ipc_CreatingNamedPipe_Format
source: Creating named pipe {0}…
de: Named Pipe {0} wird erstellt...
pl: Tworzenie nazwanego potoku {0}…

# Infrastructure_Ipc_Error_CouldNotStart
source: Could not start the helper.
de: Der Helper konnte nicht gestartet werden.
pl: Tworzenie pomocniczego procesu nie powiodło się.

# Infrastructure_Ipc_Error_CouldNotStartProcess
source: Could not start the process.
de: Der Prozess konnte nicht gestartet werden.
pl: Wystartowanie procesu nie powiodło się.

# Infrastructure_Ipc_Error_Exception
source: Reporting exception
de: Eine Ausnahme wird gemeldet
pl: Zgłaszanie wyjątku

# Infrastructure_Ipc_Error_ExclusiveAccess
source: Could not get exclusive access.
de: MSIX-Hero konnte keinen exklusiven Zugang erhalten.
pl: Próba wyłącznego dostępu nie powiodła się

# Infrastructure_Ipc_Error_NoReceiver_Format
source: No receiver for type {0} registered.
de: Kein Receiver für Typ {0} wurde registriert.
pl: Brak zarejestrowanego odbiorcy dla typu {0}.

# Infrastructure_Ipc_ReadingCmd
source: Reading command from stream…
de: Befehl aus Stream wird gelesen...
pl: Czytanie komendy ze strumienia…

# Infrastructure_Ipc_RequestedNonVoid_Format
source: Requested: {0} with return value of type {1}…
de: Angefordert: {0} mit Rückgabewert vom Typ {1}...
pl: Zażądano: {0} z typem zwracanym {1}…

# Infrastructure_Ipc_RequestedVoid_Format
source: Requested: {0} with no returned value…
de: Angefordert: {0} ohne Rückgabewert...
pl: Zażądane: {0} bez zwracanego typu.

# Infrastructure_Ipc_ReturningResults
source: Returning results via named pipe…
de: Rückgabe der Ergebnisse über named pipe...
pl: Zwracanie rezultatów przez nazwany potok…

# Infrastructure_Ipc_Sending
source: Returning actual results via named pipe…
de: Rückgabe der aktuellen Ergebnisse über named pipe...
pl: Zwracanie właściwych rezultatów przez nazwany potok…

# Infrastructure_Ipc_SID
source: Security SID is {0}.
de: Die Sicherheits-SID ist {0}.
pl: SID bezpieczeństwa wynosi {0}.

# Infrastructure_Ipc_Waiting
source: Waiting for a client connection…
de: Warten auf eine Client-Verbindung...
pl: Oczekiwanie na połączenie przez klienta…

# Infrastructure_Sdk_CreatingVolume_Format
source: Creating volume '{0}' with required size {1}…
de: Volume '{0}' mit erforderlicher Größe {1} wird erstellt...
pl: Tworzenie woluminu '{0}' o wymaganym rozmiarze {1}…

# Infrastructure_Sdk_DeletingFile_Format
source: Deleting file '{0}'…
de: Datei '{0}' wird gelöscht...
pl: Usuwanie pliku '{0}'…

# Infrastructure_Sdk_DiskPartCommand_Format
source: DISKPART.EXE command in file '{0}':
de: DISKPART.EXE Befehl in Datei '{0}':
pl: Komenda dla programu DISKPART.EXE w pliku '{0}':

# Infrastructure_Sdk_Error_DeviceGuardAccountNotAuthorized
source: The provided account is not authorized to sign via the Device Guard Signing Service.
de: Das angegebene Konto ist nicht berechtigt, über den Device Guard Signing Service zu signieren.
pl: Wybrane konto nie ma uprawnień do podpisu za pomocą usługi podpisu cyfrowego Device Guard.

# Infrastructure_Sdk_Error_DeviceGuardInvalidJson
source: The provided JSON token file is invalid.
de: Die angegebene JSON-Token-Datei ist ungültig.
pl: Wybrany token JSON nie jest poprawny.

# Infrastructure_Sdk_Error_DeviceGuardNotReachable
source: Unable to reach the Device Guard Signing Service.
de: Der Device Guard Signing Service kann nicht erreicht werden.
pl: Nie udało się połączyć z usługą podpisu cyfrowego Device Guard.

# Infrastructure_Sdk_Error_DiskPart_Format
source: Diskpart.exe failed with error code {0}.
de: Diskpart.exe ist mit Fehlercode {0} fehlgeschlagen.
pl: Diskpart.exe zwrócił błąd z kodem {0}.

# Infrastructure_Sdk_Error_MissingSdk_Format
source: Could not locate SDK part {0}.
de: SDK-Teil {0} konnte nicht gefunden werden.
pl: Nie udało się zlokalizować części SDK {0}.

# Infrastructure_Sdk_Error_NotSupportedExtension_Format
source: Extension {0} is not supported.
de: Die Erweiterung {0} wird nicht unterstützt.
pl: Roszerzenie {0} nie jest wspierane.

# Infrastructure_Sdk_Error_SigningError_EkuMismatch
source: The selected certificate cannot be used for signing purposes (EKU mismatch).
de: Das ausgewählte Zertifikat kann nicht für Signierzwecke verwendet werden (EKU-Unstimmigkeit
pl: Wybrany certyfikat nie może zostać użyty do podpisu cyfrowego ze względu na niezgodny parametr EKU.

# Infrastructure_Sdk_Error_SigningError_Expired
source: The selected certificate has expired.
de: Das ausgewählte Zertifikat ist abgelaufen.
pl: Wybrany certyfikat wygasł.

# Infrastructure_Sdk_Error_SigningError_ExtraInfo
source: Additional info from SignTool.exe:
de: Zusätzliche Informationen von SignTool.exe:
pl: Dodatkowe informacje z programu SignTool.exe:

# Infrastructure_Sdk_Error_SigningError_FailedValidation
source: The selected certificate failed validation of one of the following filters:
de: Das ausgewählte Zertifikat ist bei der Validierung eines der folgenden Filter durchgefallen:
pl: Wybrany certyfikat został negatywnie oceniony przez następujące filtry:

# Infrastructure_Sdk_Error_SigningError_Filter_Format
source: The selected certificate does not meet the {0} filter.
de: Das ausgewählte Zertifikat entspricht nicht dem Filter {0}.
pl: Wybrany certyfifikat nie spełnia filtrue {0}.

# Infrastructure_Sdk_Error_SigningError_Format
source: The package could not be signed (code {0}).
de: Das Paket konnte nicht signiert werden (Code {0}).
pl: Pakiet nie mógł zostać podpisany (kod {0}).

# Infrastructure_Sdk_Error_SigningError_NoPrivateKey
source: The selected certificate does not have a private key.
de: Das ausgewählte Zertifikat hat keinen privaten Schlüssel.
pl: Wybrany certyfikat nie ma zaszytego klucza prywatnego.

# Infrastructure_Sdk_Error_SigningError_SubjectPublisherNotEqual
source: Package publisher and certificate subject are not the same. MSIX app cannot be signed with the selected certificate.
de: Der Herausgeber des Pakets und der Subjekt des Zertifikats sind nicht identisch. MSIX-Anwendung kann nicht mit dem ausgewählten Zertifikat signiert werden.
pl: Wydawca pakietu oraz właściciel ceryfikatu nie są zgodne. Pakiet MSIX nie może zostać podpisany wybranym certyfikatem.

# Infrastructure_Sdk_Error_SigningError_Timestamp_Format
source: Selected timestamp server could not be used to sign the package (error {0}).
de: Der ausgewählte Zeitstempel-Server konnte nicht zum Signieren des Pakets verwendet werden (Fehler {0}).
pl: Wybrany server znacznika czasowego (timestamp) nie mógł zostać użyty (błąd {0}).

# Infrastructure_Sdk_Error_StartProcess
source: Failed to start process.
de: Der Prozess konnte nicht gestartet werden.
pl: Startowanie procesu nie powiodło się.

# Infrastructure_Sdk_Error_TaskListCsv
source: CSV content:
de: CSV Inhalt:
pl: Zawartość CSV:

# Infrastructure_Sdk_Error_TaskListInvalidDataFormat
source: Invalid data format.
de: Ungültiges Datenformat.
pl: Niepoprawny format danych

# Infrastructure_Sdk_Error_TaskListNonZeroExitCode
source: Tasklist.exe returned non zero exit code.
de: Tasklist.exe hat nicht den Exit-Code 0 zurückgegeben.
pl: Tasklist.exe zwrócił niezerowy kod błędu.

# Infrastructure_Sdk_Executing_Format
source: Executing {0} {1}
de: Ausführen von {0} {1}
pl: Wykonywanie {0} {1}

# Infrastructure_Sdk_FormattingAndAssigning
source: Formatting drive and assigning drive letter…
de: Laufwerk wird formatiert und Laufwerksbuchstaben wird zugewiesen...
pl: Formatowanie dysku i przypisywanie litery…

# Infrastructure_Sdk_KillingPid_Format
source: Killing the process PID={0}…
de: Beenden des Prozesses PID={0}...
pl: Zatrzymywanie procesu PID={0}…

# Infrastructure_Sdk_MakeAppx_EditCodeError_Format
source: MakeAppx.exe returned exit code {0} due to error {1}.
de: MakeAppx.exe hat Exit Code {0} wegen Fehler {1} zurückgegeben.
pl: MakeAppx.exe zwrócił kod błędu {0} ze względu na wyjątek {1}.

# Infrastructure_Sdk_MakeAppx_EditCode_Format
source: MakeAppx.exe returned exit code {0}.
de: MakeAppx.exe hat den Exit-Code {0} zurückgegeben.
pl: MakeAppx.exe zwrócił kod błędu {0}.

# Infrastructure_Sdk_MakeAppx_ExtractingFile_Format
source: Extracting file {0}…
de: Extrahieren von Datei {0}...
pl: Wypakowywanie pliku {0}…

# Infrastructure_Sdk_MsixMgr_CopyingFile
source: Copying {0} to {1}…
de: Kopieren von {0} nach {1}...
pl: Kopiowanie {0} do {1}…

# Infrastructure_Sdk_MsixMgr_Error_AdminRights
source: This operation requires admin permissions.
de: Dieser Vorgang erfordert Administratorrechte.
pl: Ta operacja wymaga uprawnień administratora.

# Infrastructure_Sdk_MsixMgr_Error_OriginalDirUnavailable
source: Original directory not available.
de: Originalverzeichnis nicht verfügbar.
pl: Oryginalny folder nie jest dostępny.

# Infrastructure_Sdk_MsixMgr_Error_TooSmallSize
source: Could not expand MSIX Package to the VHD file. The maximum size of the virtual disk is smaller than the file size of expanded MSIX package. Try using a bigger disk size.
de: Das MSIX-Paket konnte nicht in die VHD-Datei erweitert werden. Die maximale Größe der virtuellen Festplatte ist kleiner als die Dateigröße des entpackten MSIX-Pakets. Versuchen Sie, eine größere Festplatte zu verwenden.
pl: Rozpakowywanie pakietu MSIX do pliku VHD nie powiodło się. Maksymalny dozwolony rozmiar woluminu VHD jest mniejszy niż rozmiar rozpakowanej paczki. Spróbuj użyć większego rozmiaru woluminu.

# Infrastructure_Sdk_MsixMgr_ProcessExitCode
source: Process returned exit code {0}.
de: Der Prozess hat den Exit-Code {0} zurückgegeben.
pl: Proces zwrócił kod błędu {0}.

# Infrastructure_Sdk_MsixMgr_RemovingTempFolder_Format
source: Removing temporary folder {0}…
de: Der temporaräre Ordner {0} wird gelöscht...
pl: Usuwanie folderu tymczasowego {0}…

# Infrastructure_Sdk_MsixMgr_RunningWithIdentity
source: Detected MSIX Hero running with package identity. MSIXMGR must be started from a temporary location…
de: Das Programm mit Paketidentität ausgeführt wird. MSIXMGR muss von einem temporären Ordner gestartet werden.
pl: Wykryto. że MSIX Hero jest uruchomione jako aplikacji z tożsamością (identity). MSIXMGR musi zostać wystartowany z lokalizacji tymczasowej…

# Infrastructure_Sdk_ProcessExited_WrongExitCode_Format
source: Process exited with an improper exit code {0}.
de: Der Prozess wurde mit einem unzulässigen Exit-Code {0} beendet.
pl: Proces zakończył się z nieoczekiwanym kodem wyjścia {0}.

# Infrastructure_Sdk_ProcessFinished_NoStdErr
source: Process has finished and did not return anything to standard error.
de: Der Prozess wurde beendet und hat nichts in den Standardfehler zurückgegeben.
pl: Proces zakończył się i nie zwrócił nic na standardowym strumieniu błędów.

# Infrastructure_Sdk_ProcessFinished_NoStdOut
source: Process has finished and did not return anything to standard output.
de: Der Prozess wurde beendet und hat nichts auf die Standardausgabe zurückgegeben.
pl: Proces zakończył się i nie zwrócił nic na standardowym strumieniu wyjścia.

# Infrastructure_Sdk_ProcessFinished_StdErr
source: Process has finished and returned the following standard error:
de: Der Prozess wurde beendet und hat den folgenden Standardfehler zurückgegeben:
pl: Proces zakończył się i zwrócił następujący standardowy strumień błędów:

# Infrastructure_Sdk_ProcessFinished_StdOut
source: Process has finished and returned the following standard output:
de: Der Prozess wurde beendet und hat die folgende Standardausgabe zurückgegeben:
pl: Proces zakończył się i zwrócił następujący standardowy strumień wyjścia:

# Infrastructure_Sdk_VhdDismount
source: Dismounting volume…
de: Volume wird ausgehängt...
pl: Odłączanie woluminu…

# Infrastructure_Sdk_VhdMount_Format
source: Mounting volume '{0}'…
de: Datenträger '{0}' wird gemountet...
pl: Podłączanie woluminu '{0}'…

# Infrastructure_Settings_Error_UseDefault
source: Could not read the settings. Default settings will be used.
de: Die Einstellungen konnten nicht gelesen werden. Es werden die Standardeinstellungen verwendet.
pl: Czytanie ustawień nie powiodło się. Użyte zostaną ustawienia domyślne.

# Infrastructure_WrongVersion_Format
source: Version '{0}' could not be parsed as a version string.
de: Version '{0}' konnte nicht als Versionsstring geparst werden.
pl: Wartość '{0}' nie mogła zostać zinterpretowana jako wersja.

# MakeAppx_Compressing
source: Compressing {0}…
pl: Pakowanie {0}…
