Repository: Centaurioun/MSIX-Hero
Catalog: src/Otor.MsixHero.Cli/Resources/Localization.*.resx
Languages: de, pl

# CLI_CertificateSummary_ExpiresNever_Aligned
source: Expires: <never>
de: Ablaufsdatum: <keine>
pl: Wygasa: <nigdy>

# CLI_CertificateSummary_Expires_Aligned_Format
source: Expires: {0}
de: Ablaufsdatum: {0}
pl: Wygasa: {0}

# CLI_CertificateSummary_Issuer_Aligned_Format
source: Issuer: {0}
de: Herausgeber: {0}
pl: Wystawca: {0}

# CLI_CertificateSummary_SignedByUntrusted_Aligned_Format
source: Signed by: {0} (untrusted)
de: Signiert von: {0} (nicht vertrauenswürdig)
pl: Podpisał: {0} (niezaufany)

# CLI_CertificateSummary_SignedBy_Aligned_Format
source: Signed by: {0}
de: Signiert von: {0}
pl: Podpisał: {0}

# CLI_CertificateSummary_Thumbprint_Aligned_Format
source: Thumbprint: {0}
de: Fingerabdruck: {0}
pl: Odcisk: {0}

# CLI_Error_FileNotExists_Format
source: File '{0}' does not exist.
de: Die Datei '{0}' existiert nicht.
pl: Plik '{0}' nie istnieje.

# CLI_Error_Manifest_Empty
source: Document root cannot be empty.
de: Der Root eines Dokuments darf nicht leer sein.
pl: Główny element nie może być pusty.

# CLI_Executor_AddFile_Error_AlreadyExists_Format
source: File '{0}' could not be added because the destination file '{1}' already exists.
de: Datei '{0}' konnte nicht hinzugefügt werden, da die Zieldatei '{1}' bereits existiert.
pl: Plik '{0}' nie mógł zostać dodany, ponieważ docelowy plik '{1}' już istnieje.

# CLI_Executor_AddFile_Error_AlreadyExists_Hint
source: You can force replacement of the file by using --force switch.
de: Sie können die Ersetzung der Datei mit der Option --force erzwingen.
pl: Możesz wymusić dodanie tego pliku, używając przełącznika --force.

# CLI_Executor_AddFile_Error_CouldNotAdd_Format
source: File '{0}' could not be added to '{1}'.
de: Datei '{0}' konnte nicht als '{1}' hinzugefügt werden.
pl: Plik '{0}' nie mógł zostać dodany jako '{1}'.

# CLI_Executor_AddFile_Error_DirectManifestImport
source: Manifest file cannot be added directly.
de: Die Manifestdatei kann nicht direkt hinzugefügt werden.
pl: Plik manifestu nie może zostać dodany bezpośrednio.

# CLI_Executor_AddFile_Error_Missing_Format
source: File '{0}' does not exist.
de: Die Datei '{0}' existiert nicht.
pl: Plik '{0}' nie istnieje.

# CLI_Executor_AddFile_Success_Format
source: File '{0}' has been imported into '{1}'.
de: Die Datei '{0}' wurde in '{1}' importiert.
pl: Plik '{0}' został zaimportowany do '{1}'.

# CLI_Executor_AppAttach_CreatingVolumes_Format
source: Creating volume(s) in '{0}'…
de: Volumen wird/werden in '{0}' erstellt..
pl: Tworzenie wolumin(ów) w '{0}'…

# CLI_Executor_AppAttach_Error_NameSwitchConflict
source: Parameter --name/-n cannot be used with more than one instance of the --package/-p switch.
de: Der Parameter --name/-n darf nicht mit mehr als einer Instanz des Schalters --package/-p verwendet werden.
pl: Parametr --name/-n nie może byż używany razem z więcej niż jednym wystąpieniem parametru --package/-p.

# CLI_Executor_AppAttach_Error_NotAdmin
source: This command can be started only by a local administrator.
de: Dieser Befehl kann nur von einem lokalen Administrator gestartet werden.
pl: Ta komenda wymaga uprawnień administracyjnych.

# CLI_Executor_AppAttach_Error_SizeCimSwitchConflict
source: Parameter --size/-s cannot be used with target type CIM.
de: Der Parameter --size/-s kann nicht mit dem Zieltyp CIM verwendet werden.
pl: Parametr --size/-s nie może być używany, jeśli docelowym typem jest CIM.

# CLI_Executor_AppAttach_Error_SizeSwitchConflict
source: Parameter --size/-s cannot be used with more than one instance of the --package/-p switch.
de: Der Parameter --size/-s kann nicht mit mehr als einer Instanz des Schalters --package/-p verwendet werden.
pl: Parametr --size/-s nie może byż używany razem z więcej niż jednym wystąpieniem parametru --package/-p.

# CLI_Executor_AppAttach_Success_Certificate_Format
source: Extracted certificate file '{0}'.
de: Zertifikatsdatei '{0}' wurde extrahiert.
pl: Wypakowywanie certyfikatu '{0}'.

# CLI_Executor_AppAttach_Success_Format
source: Created volume '{0}'.
de: Volumen '{0}' wurde erstellt.
pl: Utworzono wolumin '{0}'.

# CLI_Executor_AppAttach_Success_Json_Format
source: Created definition: '{0}' with the following parameters:
de: Die Definition: '{0}' wurde mit den folgenden Parametern erstellt:
pl: Stworzono definicję: '{0}' o następujących parametrach:

# CLI_Executor_AppAttach_Success_Scripts_Format
source: Created scripts: '{0}', '{1}', '{2}', '{3}'.
de: Skripte wurden erstellt: '{0}', '{1}', '{2}', '{3}'.
pl: Stworzono skrypty: '{0}', '{1}', '{2}', '{3}'.

# CLI_Executor_BuildMetaData_Error_EmptyName
source: Build meta data name cannot be empty.
de: Der Name der Build-Metadaten darf nicht leer sein.
pl: Meta-dane nie mogą posiadać pustej nazwy.

# CLI_Executor_BuildMetaData_Error_EmptyVersion
source: Build meta data version cannot be empty.
de: Die Version der Build-Metadaten darf nicht leer sein.
pl: Meta-dane nie mogą posiadać pustej wartości.

# CLI_Executor_BuildMetaData_Error_Format
source: Build meta data '{0}' could not be added.
de: Build-Metadaten '{0}' konnten nicht hinzugefügt werden.
pl: Meta-dane '{0}' nie mogły zostać dodane.

# CLI_Executor_BuildMetaData_Success_Change_Format
source: Changed '{0}' from '{1}' to '{2}'.
de: Das Attribut '{0}' wurde von '{1}' zu '{2}' geändert.
pl: Zmieniono atrybut '{0}' z '{1}' na '{2}'.

# CLI_Executor_BuildMetaData_Success_Set_Format
source: Set '{0}' to '{1}'.
de: Das Attribut '{0}' wurde auf '{1}' gesetzt.
pl: Ustawiono '{0}' na '{1}'.

# CLI_Executor_Capability_Error_CouldNotAdd_Format
source: Capability '{0}' could not be added.
de: Die Capability '{0}' konnte nicht hinzugefügt werden.
pl: Uprawnienie '{0}' nie mogło zostać dodane.

# CLI_Executor_Capability_Error_Empty
source: Capability name cannot be empty.
de: Der Capability-Name darf nicht leer sein.
pl: Nazwa uprawnienia nie może być pusta.

# CLI_Executor_Capability_Error_NotGuid_Format
source: The value '{0}' is not a GUID nor a valid string.
de: Der Wert '{0}' ist weder eine GUID noch eine gültige Zeichenkette.
pl: Wartość '{0}' nie jest poprawnym GUID-em.

# CLI_Executor_Capability_Error_TooLong_Format
source: The value '{0}' is longer than {1} characters.
de: Der Wert '{0}' ist länger als {1} Zeichen.
pl: Wartość '{0}' jest dłuższa niż {1} znaków.

# CLI_Executor_Capability_Success_Custom_Format
source: Added custom capability '{0}'.
de: Benutzerdefinierte Capability '{0}' wurde hinzugefügt.
pl: Dodano własne uprawnienie '{0}'.

# CLI_Executor_Capability_Success_Restricted_Format
source: Added restricted capability '{0}'.
de: Eingeschränkte Capability '{0}' wurde hinzugefügt.
pl: Dodano zastrzeżone uprawnienie '{0}'.

# CLI_Executor_Capability_Success_Standard_Format
source: Added standard capability '{0}'.
de: Standard-Capability '{0}' wurde hinzugefügt.
pl: Dodano standardowe uprawnienie '{0}'.

# CLI_Executor_DeleteRegistryKey_Error_Format
source: Could not delete registry key '{0}\{1}'.
de: Der Registry-Schlüssel '{0}\{1}' konnte nicht gelöscht werden.
pl: Usuwanie klucza rejestru '{0}\{1}' nie powiodło się.

# CLI_Executor_DeleteRegistryKey_Success_Format
source: Registry key '{0}\{1}' has been removed.
de: Der Registry-Schlüssel '{0}\{1}' wurde entfernt.
pl: Klucz rejestru '{0}\{1}' został usunięty.

# CLI_Executor_DeleteRegistryValue_Error_Format
source: Registry value '{0}' could not be removed from '{1}\{2}'.
de: Der Registry-Wert '{0}' konnte nicht aus '{1}\{2}' entfernt werden.
pl: Wartość rejestru '{0}' nie mogła zostać usunięta z klucza '{1}\{2}'.

# CLI_Executor_DeleteRegistryValue_Success_Format
source: Registry value '{0}' has been removed from '{1}\{2}.
de: Der Registry-Wert '{0}' wurde aus '{1}\{2}' entfernt.
pl: Wartość rejestru '{0}' została usunięta z klucza '{1}\{2}.

# CLI_Executor_Dependencies_Reading
source: Reading dependencies…
de: Abhängigkeiten werden gelesen…
pl: Czytanie zależności…

# CLI_Executor_DidYouMean_Format
source: Did you mean '{0}'?
de: Meinten Sie '{0}'?
pl: Czy miałeś na myśli '{0}'?

# CLI_Executor_Error_PathNotExist_Format
source: The path '{0}' does not exist.
de: Der Pfad '{0}' existiert nicht.
pl: Ścieżka '{0}' nie istnieje.

# CLI_Executor_Error_PathNotSupported_Format
source: The path '{0}' is neither a directory with extracted MSIX, an .MSIX package or a manifest file.
de: Der Pfad '{0}' ist weder ein Verzeichnis mit extrahierten MSIX, ein .MSIX-Paket noch eine Manifestdatei.
pl: Ścieżka '{0}' nie jest ani folderem z wypakowaną zawartością MSIX, ani paczką .MSIX, ani plikiem manifestu.

# CLI_Executor_ExtractCert_Extracting_Format
source: Extracting certificate from '{0}'…
de: Extrahieren des Zertifikats von '{0}'…
pl: Wypakowywanie certyfikatu do '{0}'…

# CLI_Executor_ExtractCert_Success
source: Certificate has been extracted.
de: Das Zertifikat wurde extrahiert.
pl: Certyfikat został wypakowany.

# CLI_Executor_ImportRegistry_Error_InputMissing
source: Either the file path or the local registry path must be provided.
de: Es muss entweder der Dateipfad oder der lokale Registry-Pfad angegeben werden.
pl: Ścieżka do pliku albo ścieżka do lokalnego klucza rejestru muszą być podane.

# CLI_Executor_ImportRegistry_Error_InvalidHive
source: Registry key must be a path starting with a valid hive name.
de: Der Registry-Schlüssel muss ein Pfad sein, der mit einem gültigen Hive-Namen beginnt.
pl: Klucz rejestru musi być ścieżką, zaczynającą się od poprawnej gałęzi.

# CLI_Executor_ImportRegistry_Error_MissingFile_Format
source: Registry file '{0}' does not exist.
de: Die Registry-Datei '{0}' existiert nicht.
pl: Plik rejestru '{0}' nie istnieje.

# CLI_Executor_ImportRegistry_Error_UnsupportedHive_Format
source: Registry hive {0} is not supported.
de: Registry Hive {0} wird nicht unterstützt.
pl: Gałąź {0} nie jest wspierana.

# CLI_Executor_List_Error_MissingFile_Format
source: The file '{0}' does not exist.
de: Die Datei '{0}' existiert nicht.
pl: Plik '{0}' nie istnieje.

# CLI_Executor_List_Error_NoCommands
source: At least one command must be passed.
de: Es muss mindestens ein Befehl angegeben werden.
pl: Przynajmniej jedna komenda jest wymagana.

# CLI_Executor_List_Error_NoCommandsInFile
source: The file contains no commands.
de: Die Datei enthält keine Befehle.
pl: Plik nie zawiera komend.

# CLI_Executor_List_Error_Parsing_Format
source: The following line could not be parsed: {0}
de: Die folgende Zeile konnte nicht geparst werden: {0}
pl: Nie udało się zinterpretować następującej linii: {0}

# CLI_Executor_List_Error_Split
source: Unable to split argument.
de: Das Argument kann nicht gesplittet werden.
pl: Nie udało się rozdzielić argumentów

# CLI_Executor_List_NoFileDefined
source: No file with MSIX Hero commands was defined.
de: Es wurde keine Datei mit MSIX Hero-Befehlen definiert.
pl: Nie zdefiniowano pliku z komendami MSIX Hero.

# CLI_Executor_List_NoFileDefined_Instructions
source: Enter the required command line-by-line, and then finish by pressing <Enter> twice.
de: Geben Sie den gewünschten Befehl zeilenweise ein und beenden Sie die Eingabe durch zweimaliges Drücken von <Enter>.
pl: Wprowadź zadaną komendę linia-po-linii, i zakończ wciskając dwukrotnie klawisz <Enter>.

# CLI_Executor_ManifestEdit_MissingFile_Format
source: Manifest file '{0}' does not exist.
de: Die Manifestdatei '{0}' existiert nicht.
pl: Plik manifestu '{0}' nie istnieje.

# CLI_Executor_ModPack_Success_Format
source: Modification package created in '{0}'.
de: Das Modifikationspaket wurde in '{0}' erstellt.
pl: Pakiet modyfikujący został zapisany jako '{0}'.

# CLI_Executor_NewCert_Creating_Format
source: Creating a new certificate for '{0}'…
de: Erstellen eines neuen Zertifikats für '{0}'…
pl: Tworzenie nowego pliku certyfikatu dla '{0}'…

# CLI_Executor_NewCert_ImportingTrustedPeople
source: Importing certificate file to the list of trusted people…
de: Importieren der Zertifikatsdatei in die Liste der vertrauenswürdigen Personen…
pl: Importowanie pliku certyfikatu do magazynu certyfikatów zaufanych osób…

# CLI_Executor_NewCert_ImportingTrustedPeople_Success
source: Certificate has been imported to the Trusted People store.
de: Das Zertifikat wurde in den Speicher für vertrauenswürdige Personen importiert.
pl: Certyfikat został zaimportowany do magazynu certyfikatów zaufanych osób.

# CLI_Executor_NewCert_Success_Format
source: Certificate has been saved to '{0}'.
de: Das Zertifikat wurde in '{0}' gespeichert.
pl: Certyfikat został zapisany w '{0}'.

# CLI_Executor_OpeningFile_Format
source: Opening '{0}'…
de: Die Datei '{0}' wird geöffnet…
pl: Otwieranie '{0}'…

# CLI_Executor_Pack_Packing_Format
source: Packing '{0}' to '{1}'…
de: Komprimieren von '{0}' nach '{1}'…
pl: Pakowanie '{0}' do '{1}'…

# CLI_Executor_Pack_RemovingSource_Format
source: Removing source directory {0}...
de: Entfernen des Quellverzeichnisses {0}…
pl: Usuwanie źródłowego folderu '{0}'…

# CLI_Executor_Pack_Success_Format
source: Package '{0}' has been created.
de: Das Paket '{0}' wurde erstellt.
pl: Pakiet '{0}' został utworzony.

# CLI_Executor_Registry_Error_Binary
source: The binary value must be a valid base64 string, a comma-separated list of byte values or a hex string representing bytes.
de: Der Binärwert muss eine gültige base64-Zeichenfolge, eine durch kommagetrennte Liste von Bytewerten oder eine Hex-Zeichenfolge sein, die Bytes darstellt.
pl: Wartość binarna musi być poprawnym ciągiem w formacie base64, oddzieloną przecinkami listą wartości kolejnych bajtów lub szesnastkowym zapisem, reprezentującym bajty.

# CLI_Executor_Registry_Error_ByteDecimal_Format
source: The value '{0}' does not represent a correct decimal value for a byte.
de: Der Wert '{0}' stellt keinen korrekten Dezimalwert für ein Byte dar.
pl: Wartość '{0}' nie odpowiada poprawnej liczbie reprezentującej pojedynczy bajt.

# CLI_Executor_Registry_Error_ByteHex_Format
source: The value '{0}' does not represent a correct hex-string for a byte.
de: Der Wert '{0}' stellt keine korrekte Hex-Zeichenkette für ein Byte dar.
pl: Wartość '{0}' nie odpowiada poprawnej liczbie szesnastkowej reprezentującej pojedynczy bajt.

# CLI_Executor_Registry_Error_CsvByte_Format
source: The comma-separated value '{0}' does not represent a correct byte sequence.
de: Der kommagetrennte Wert '{0}' stellt keine korrekte Bytefolge dar.
pl: Wartość oddzielona przecinkami '{0}' nie odpowiada poprawnej sekwencji bajtów.

# CLI_Executor_Registry_Error_DwordRange_Format
source: The value '{0}' is not within the range of DWORD values ({1}-{2}).
de: Der Wert '{0}' liegt nicht innerhalb des Bereichs der DWORD-Werte ({1}-{2}).
pl: Wartość '{0}' nie leży w zakresie wartości DWORD ({1}-{2}).

# CLI_Executor_Registry_Error_HexParsing_Format
source: The hexadecimal string '{0}' could not be parsed.
de: Die hexadezimale Zeichenfolge '{0}' konnte nicht geparst werden.
pl: Łańcuch szesnastkowy '{0}' nie mógł zostać poprawnie zinterpretowany.

# CLI_Executor_Registry_Error_Hex_Format
source: The value '{0}' is not a valid hexadecimal number.
de: Der Wert '{0}' ist keine gültige Hexadezimalzahl.
pl: Wartość '{0}' nie jest poprawnym zapisem szesnastkowym.

# CLI_Executor_Registry_Error_Number_Format
source: The value '{0}' is not a valid number.
de: Der Wert '{0}' ist keine gültige Zahl.
pl: Wartość '{0}' nie jest poprawną liczbą.

# CLI_Executor_RemoveFile_Error_CouldNotRemove_Format
source: File '{0}' could not be removed.
de: Die Datei '{0}' konnte nicht entfernt werden.
pl: Plik '{0}' nie mógł zostać usunięty.

# CLI_Executor_RemoveFile_Success_Format
source: File '{0}' has been removed.
de: Die Datei '{0}' wurde entfernt.
pl: Plik '{0}' został usunięty.

# CLI_Executor_SavingFile_Format
source: Saving '{0}'…
de: Speichern von '{0}'…
pl: Zapisywanie '{0}'…

# CLI_Executor_SetIdentity_Error_NoProperty
source: At least one property to change is required.
de: Mindestens eine zu ändernde Eigenschaft ist erforderlich.
pl: Przynajmniej jedna zmiana jest wymagana.

# CLI_Executor_SetIdentity_Error_PackageName
source: The format of the package name is invalid.
de: Das Format des Paketnamens ist ungültig.
pl: Format nazwy pakietu jest niepoprawny.

# CLI_Executor_SetIdentity_Error_PublisherFormat
source: The format of the publisher is invalid.
de: Das Format des Herausgebers ist ungültig.
pl: Format wydawcy jest niepoprawny.

# CLI_Executor_SetIdentity_Error_ResourceId
source: The format of the resource ID is invalid.
de: Das Format der Ressourcen-ID ist ungültig.
pl: Format identyfikatora zasobu jest niepoprawny.

# CLI_Executor_SetIdentity_Success_Change_Format
source: Changed identity attribute '{0}' from '{1}' to '{2}'.
de: Das Identitätsattribut '{0}' wurde von '{1}' auf '{2}' geändert.
pl: Zmieniono atrybut '{0}' z '{1}' na '{2}'.

# CLI_Executor_SetIdentity_Success_Set_Format
source: Set identity attribute '{0}' to '{1}'.
de: Das Identitätsattribut wird '{0}' auf '{1}' gesetzt.
pl: Ustawiono '{0}' na '{1}'.

# CLI_Executor_SetRegistryKey_Error_Format
source: Could not set registry key '{0}\{1}'
de: Registry-Schlüssel '{0}\{1}' konnte nicht gesetzt werden
pl: Ustawianie klucza rejestru '{0}\{1}' nie powiodło się.

# CLI_Executor_SetRegistryKey_Success_Format
source: Registry key '{0}\{1}' has been set.
de: Der Registry-Schlüssel '{0}\{1}' wurde gesetzt.
pl: Klucz rejestru '{0}\{1}' został ustawiony.

# CLI_Executor_SetRegistryValue_Error_Format
source: Could not set registry value '{0}' to '{1}' ({2}) in '{3}\{4}'.
de: Der Registry-Wert '{0}' konnte nicht auf '{1}' ({2}) in '{3}\{4}' gesetzt werden.
pl: Ustawianie wartości '{0}' na '{1}' ({2}) w '{3}\{4}' nie powiodło się.

# CLI_Executor_SetRegistryValue_Error_ParseType_Format
source: Value type '{0}' could not be parsed.
de: Der Wertetyp '{0}' konnte nicht geparst werden.
pl: Typ wartości '{0}' nie mógł zostać poprawnie zinterpretowany.

# CLI_Executor_SetRegistryValue_Error_TypeNotSupported_Format
source: The value type '{0}' is not supported.
de: Der Wertetyp '{0}' wird nicht unterstützt.
pl: Typ wartości '{0}' nie jest wspierany.

# CLI_Executor_SetRegistryValue_Success_Format
source: Registry value '{0}' has been set to '{1}' ({2}) in '{3}\{4}'.
de: Der Registry-Wert "{0}" wurde auf '{1}' ({2}) in '{3}{4}' gesetzt.
pl: Ustawiono wartość '{0}' na '{1}' ({2}) w '{3}\{4}'.

# CLI_Executor_Sign_DeviceGuardDeterminingPublisher
source: Determining publisher name from Device Guard Signing certificate...
de: Ermittlung des Herausgebernamens aus dem Device Guard Signing-Zertifikat…
pl: Ustalanie nazwy wydawcy z certyfikatu z usługi Device Guard…

# CLI_Executor_Sign_DeviceGuardSigning_Format
source: Signing '{0}' with Device Guard…
de: Signieren von '{0}' mit Device Guard…
pl: Podpisywanie '{0}' za pomocą usługi Device Guard…

# CLI_Executor_Sign_Error_Code_Format
source: Signing failed with error code {0}: {1}
de: Signierung mit Fehlercode {0} fehlgeschlagen: {1}
pl: Podpisywanie nie powiodło się i zwróciło kod błędu {0}: {1}

# CLI_Executor_Sign_Error_DecryptFailed
source: Could not use the configured password. Decryption of the string from settings failed.
de: Das konfigurierte Kennwort konnte nicht verwendet werden. Die Entschlüsselung der Zeichenkette aus den Einstellungen ist fehlgeschlagen.
pl: Stosowanie skonfigurowanego hasła nie powiodło się. Nie udało się zdeszyfrować zakodowanego hasła.

# CLI_Executor_Sign_Error_DeviceGuardNoConfig
source: Device Guard has not been configured yet.
de: Device Guard wurde noch nicht konfiguriert.
pl: Usługa Device Guard nie została jeszcze skonfigurowana.

# CLI_Executor_Sign_Error_InvalidTimestampUrl_Format
source: The value '{0}' is not a valid URI.
de: Der Wert '{0}' ist kein gültiger URI.
pl: Wartość '{0}' nie jest poprawnym adresem URL.

# CLI_Executor_Sign_Error_Message_Format
source: Signing failed: {0}
de: Signierung fehlgeschlagen: {0}
pl: Podpisywanie nie powiodło się: {0}

# CLI_Executor_Sign_Error_NoCertAndDefaultConfig
source: No certificate has been provided, and no default certificate has been configured in MSIX Hero settings.
de: Es wurde kein Zertifikat bereitgestellt, und in den MSIX Hero-Einstellungen wurde kein Standardzertifikat konfiguriert.
pl: Nie podano pliku certyfikatu ani nie ustawiono opcji podpisu domyślnym certyfikatem w ustawieniach programu MSIX Hero.

# CLI_Executor_Sign_Error_NoConfig
source: In order to sign with CLI without any extra signing parameters, configure your signature in MSIX Hero settings.
de: Um mit CLI ohne zusätzliche Signierparameter zu signieren, konfigurieren Sie Ihre Signatur in den MSIX Hero-Einstellungen.
pl: Aby podpisywać przy użyciu CLI i bez podawania dodatkowych parametrów, podpis cyfrowy musi zostać wcześniej skonfigurowany w opcjach programu MSIX Hero.

# CLI_Executor_Sign_Error_OptionConflict_Format
source: Options --{0} and --{1} cannot be used together.
de: Die Optionen --{0} und --{1} können nicht zusammen verwendet werden.
pl: Parametry --{0} and --{1} nie mogą być używane jednocześnie.

# CLI_Executor_Sign_Error_Option_Format
source: Option --{0}: {1}
pl: Parametr --{0}: {1}

# CLI_Executor_Sign_Error_WrongThumbprint_Format
source: Certificate with thumbprint '{0}' was not found.
de: Zertifikat mit Fingerabdruck '{0}' wurde nicht gefunden.
pl: Certyfikat z odciskiem '{0} nie został odnaleziony.

# CLI_Executor_Sign_NewName_Format
source: New publisher name is '{0}'.
de: Der neue Herausgebername lautet '{0}'.
pl: Nowa nazwa wydawcy = '{0}'.

# CLI_Executor_Sign_SigningCerFile_Format
source: Signing '{0}' with certificate '{1}'…
de: Signieren von '{0}' mit Zertifikat '{1}'…
pl: Podpisywanie '{0}' przy użyciu certyfikatu '{1}'…

# CLI_Executor_Sign_SigningSha_Format
source: Signing '{0}' with certificate [SHA1 = {1}]...
de: Signieren von '{0}' mit Zertifikat [SHA1 = {1}]…
pl: Podpisywanie '{0}' przy użyciu certyfikatu [SHA1 = {1}]…

# CLI_Executor_Sign_Success
source: Package signed successfully!
de: Das Paket wurde erfolgreich signiert!
pl: Pakiet został pomyślnie podpisany!

# CLI_Executor_Sign_UsingCurrent
source: Using current MSIX Hero signing options...
de: Die aktuellen MSIX Hero-Signieroptionen werden verwendet…
pl: Stosowanie obecnych opcji podpisywania z programu MSIX Hero…

# CLI_Executor_Trust_Importing_Format
source: Importing certificate from '{0}'…
de: Importiere Zertifikat von '{0}'…
pl: Importowanie certyfikatu z '{0}'…

# CLI_Executor_Trust_Success
source: Certificate has been imported.
de: Das Zertifikat wurde importiert.
pl: Certyfikat został poprawnie zaimportowany.

# CLI_Executor_Unpack_RemovingSource_Format
source: Removing source package '{0}'...
de: Entfernen des Quellpakets '{0}'…
pl: Usuwanie źródłowego pakietu '{0}'…

# CLI_Executor_Unpack_Success_Format
source: The package has been unpacked to '{0}'.
de: Das Paket wurde nach '{0}' entpackt.
pl: Pakiet został rozpakowany w '{0}'.

# CLI_Executor_Unpack_Unpacking_Format
source: Unpacking '{0}' to '{1}'...
de: Entpacken von '{0}' nach '{1}'…
pl: Rozpakowywanie '{0}' do '{1}'…

# CLI_Executor_UpdateImpact_Comparing
source: Comparing packages...
de: Die Pakete werden verglichen…
pl: Porównywanie pakietów…

# CLI_Executor_UpdateImpact_Error_AccessDenied_Format
source: Could not write to '{0}'. Access denied (error code: {1}).
de: Konnte nicht in '{0}' schreiben. Zugriff verweigert (Fehlercode: {1}).
pl: Zapis do '{0}' nie powódł się. Odmowa dostępu (kod błędu: {1}).

# CLI_Executor_UpdateImpact_Error_Format
source: Invalid package format.
de: Ungültiges Paketformat.
pl: Niepoprawny format pakietu.

# CLI_Executor_UpdateImpact_Error_InvalidPath
source: The path to XML file is invalid.
de: Der Pfad zur XML-Datei ist ungültig.
pl: Ściezka do pliku XML jest niepoprawna.
