Repository: Centaurioun/MSIX-Hero
Catalog: src/Otor.MsixHero.Cli/Resources/Localization.*.resx
Languages: de, pl

# CLI_Executor_UpdateImpact_Error_InvalidWindowsPath
source: The path to XML file is invalid. It must be a valid Windows path.
de: Der Pfad zur XML-Datei ist ungültig. Es muss ein gültiger Windows-Pfad sein.
pl: Ściezka do pliku XML jest niepoprawna. Wartość ta musi być poprawną ścieżką ,akceptowalną przez system Windows.

# CLI_Executor_UpdateImpact_Error_InvalidXMLPath
source: The path to XML file is invalid.
de: Der Pfad zur XML-Datei ist ungültig.
pl: Ściezka do pliku XML jest niepoprawna.

# CLI_Executor_UpdateImpact_Error_MessageCode_Format
source: {0} (error code: {1})
de: {0} (Fehlercode: {1})
pl: {0} (kod błędu: {1})

# CLI_Executor_UpdateImpact_Error_NewPackageMissing
source: The new package path is required.
de: Der neue Paketpfad ist erforderlich.
pl: Nowsza wersja pakietu jest wymagana.

# CLI_Executor_UpdateImpact_Error_NotSameFamily
source: Selected packages could not be analyzed, because they are not upgradable. For an upgrade to work, the package family name must be the same.
de: Ausgewählte Pakete konnten nicht analysiert werden, da sie nicht upgradefähig sind. Damit ein Upgrade funktioniert, muss der Name der Paketfamilie identisch sein.
pl: Wybrane pakiety nie mogły zostać przeanalizowane, ponieważ jedna nie zastępuje drugiej wprost. Aby aktualizacja była możliwa, rodziny (Package Family) obu pakietów muszą być takie same.

# CLI_Executor_UpdateImpact_Error_OldPackageMissing
source: The old package path is required.
de: Der alte Paketpfad ist erforderlich.
pl: Poprzednia wersja pakietu jest wymagana.

# CLI_Executor_UpdateImpact_Error_Unknown
source: The packages could not be compared.
de: Die Pakete konnten nicht verglichen werden.
pl: Pakiety nie mogły zostać porównane.

# CLI_Executor_UpdateImpact_Error_UnknownCode_Format
source: Could not write the results to '{0}' (error code: {1})
de: Die Ergebnisse konnten nicht in ''{0}'' geschrieben werden (Fehlercode: {1})
pl: Zapis do {0} nie powiódł się (kod błędu: {1})

# CLI_Executor_UpdateImpact_Error_Versioning
source: Selected packages could not be analyzed, because the version of the 'oldPackage' is newer than the version of the 'newPackage'.
de: Ausgewählte Pakete konnten nicht analysiert werden, weil die Version des 'oldPackage' neuer ist als die Version des 'newPackage'.
pl: Wybrane pakiety nie mogły zostać przeanalizowane, ponieważ wersja poprzedniego pakietu jest nowsza niż wersja następującego.

# CLI_Executor_UpdateImpact_Error_Versioning_Hint
source: Consider using command line switch --force to ignore this check.
de: Verwenden Sie den Befehlszeilenschalter --force, um diese Prüfung zu ignorieren.
pl: Rozważ użycie przełącznika linii komend --force aby pominąć to sprawdzanie.

# CLI_Executor_UpdateImpact_Success
source: Selected packages have been successfully compared.
de: Ausgewählte Pakete sind erfolgreich verglichen worden.
pl: Wybrane paczki zostały porównane.

# CLI_Executor_UpdateImpact_Success_File_Format
source: XML file with results has been saved to '{0}'.
de: Die XML-Datei mit den Ergebnissen wurde in '{0}' gespeichert.
pl: Plik XML ze szczegółowymi rezultatami został zapisany jako '{0}'.

# CLI_Executor_UpdateImpact_Success_MoreDetails
source: To get more details, rerun this command with --xml "<output_file_path>" switch.
de: Um weitere Details zu erhalten, führen Sie diesen Befehl erneut mit der Option --xml "<output_file_path>" aus.
pl: Aby uzyskać więcej informacji, uruchom tę komendę ponownie, dodając przełącznik --xml "<sciezka_do_pliku_z_wynikami>".

# CLI_Executor_UpdateImpact_Summary_Added
source: Added files
de: Neue Dateien
pl: Dodane pliki

# CLI_Executor_UpdateImpact_Summary_BlocksChanged_Format
source: Blocks = {0} -> {1}
de: Blöcke = {0} -> {1}
pl: Bloki = {0} -> {1}

# CLI_Executor_UpdateImpact_Summary_Blocks_Format
source: Blocks = {0}
de: Blöcke = {0}
pl: Bloki = {0}

# CLI_Executor_UpdateImpact_Summary_Changed
source: Changed files
de: Geänderte Dateien
pl: Zmienione pliki

# CLI_Executor_UpdateImpact_Summary_Count_Format
source: Count = {0}
de: Anzahl = {0}
pl: Liczba = {0}

# CLI_Executor_UpdateImpact_Summary_Deleted
source: Deleted files
de: Gelöschte Dateien
pl: Usunięte pliki

# CLI_Executor_UpdateImpact_Summary_NetSizeDiff_Format
source: Net size difference = {0} bytes
de: Differenz der Nettogröße = {0} Bytes
pl: Zmiana rozmiaru netto = {0} bytes

# CLI_Executor_UpdateImpact_Summary_NewBytes_Format
source: New = {0} bytes
de: Neue = {0} Bytes
pl: Nowy = {0} bytes

# CLI_Executor_UpdateImpact_Summary_OldBytes_Format
source: Old = {0} bytes
de: Alte = {0} Bytes
pl: Stary = {0} bytes

# CLI_Executor_UpdateImpact_Summary_PackageSize
source: Package size
de: Paketgröße
pl: Rozmiar pakietu

# CLI_Executor_UpdateImpact_Summary_RequiredDownload_Format
source: Required download = {0} bytes
de: Erforderlicher Download = {0} Bytes
pl: Wymagany transfer = {0} bytes

# CLI_Executor_UpdateImpact_Summary_SizeChanged_Format
source: Size = {0} -> {1}
de: Größe = {0} -> {1}
pl: Rozmiar = {0} -> {1}

# CLI_Executor_UpdateImpact_Summary_Size_Format
source: Size = {0}
de: Größe = {0}
pl: Rozmiar = {0}

# CLI_Executor_UpdateImpact_Summary_Unchanged
source: Unchanged files
de: Unveränderte Dateien
pl: Niezmienione pliki

# CLI_Executor_UpdateImpact_Summary_UpdateImpact
source: Update impact
de: Auswirkung der Aktualisierung
pl: Wpływ na aktualizację

# CLI_Executor_Warn_SkippedDueToPreviousErrors
source: The package has not been updated due to previous errors.
de: Das Paket wurde aufgrund von früheren Fehlern nicht aktualisiert.
pl: Pakiet nie został zaktualizowany ze względu na poprzednie problemy.

# CLI_InvalidPassword
source: Could not use the configured password. Decryption of the string from settings failed.
de: Das konfigurierte Kennwort konnte nicht verwendet werden. Die Entschlüsselung der Zeichenkette aus den Einstellungen ist fehlgeschlagen.
pl: Nie można było użyć skonfigurowanego hasła. Odszyfrowywanie z poziomu ustawień nie powiodło się.

# CommandLineParser_Group
source: Group
de: Gruppe
pl: Grupa

# CommandLineParser_SentenceBadFormatConversionErrorOption
source: Option '{0}' is defined with a bad format.
de: Die Option '{0}' ist mit einem ungültigen Format definiert.
pl: Opcja '{0}' jest zdefiniowana w niepoprawnym formacie.

# CommandLineParser_SentenceBadFormatConversionErrorValue
source: A value not bound to option name is defined with a bad format.
de: Ein nicht an den Optionsnamen gebundener Wert ist mit einem ungültigen Format definiert.
pl: Wartość nieprzypisana do nazwanej opcji jest zdefiniowana w niepoprawnym formacie.

# CommandLineParser_SentenceBadFormatTokenError
source: Token '{0}' is not recognized.
de: Das Token '{0}' wird nicht erkannt.
pl: Token '{0}' nie został rozpoznany.

# CommandLineParser_SentenceBadVerbSelectedError
source: Verb '{0}' is not recognized.
de: Der Befehl '{0}' wird nicht erkannt.
pl: Komenda '{0}'nie została rozponana.

# CommandLineParser_SentenceErrorsHeadingText
source: ERROR(S):
de: FEHLER:
pl: BŁĄD/BŁĘDY:

# CommandLineParser_SentenceHelpCommandTextOption
source: Display this help screen.
de: Zeigt diesen Hilfebildschirm an.
pl: Wyświetla ten ekran pomocy.

# CommandLineParser_SentenceHelpCommandTextVerb
source: Display more information on a specific command.
de: Zeigt weitere Informationen zu einem bestimmten Befehl an.
pl: Wyświetla więcej informacji o wybranej komendzie.

# CommandLineParser_SentenceMissingRequiredOptionError
source: Required option '{0}' is missing.
de: Die erforderliche Option '{0}' fehlt.
pl: Wymagana opcja '{0}' nie została podana.

# CommandLineParser_SentenceMissingRequiredValueError
source: A required value not bound to option name is missing.
de: Ein erforderlicher Wert, der nicht an den Optionsnamen gebunden ist, fehlt.
pl: Wymagana wartość nieprzypisana do nazwanej opcji nie została podana.

# CommandLineParser_SentenceMissingValueOptionError
source: Option '{0}' has no value.
de: Die Option '{0}' hat keinen Wert.
pl: Opcja '{0}' nie posiada wartości.

# CommandLineParser_SentenceMutuallyExclusiveSetErrors
source: Options: {0} are not compatible with {1}.
de: Optionen: {0} sind nicht kompatibel mit {1}.
pl: Opcje: {0} nie są wzajemnie kompatyilne z {1}.

# CommandLineParser_SentenceNoVerbSelectedError
source: No verb selected.
de: Kein Befehl ausgewählt.
pl: Nie wybrano komendy.

# CommandLineParser_SentenceRepeatedOptionError
source: Option '{0}' is defined multiple times.
de: Die Option '{0}' ist mehrfach definiert.
pl: Opcja '{0}' zostła zdefiniowana wielokrotnie.

# CommandLineParser_SentenceRequiredWord
source: Required.
de: Erforderlich.
pl: Wymagana.

# CommandLineParser_SentenceSequenceOutOfRangeErrorOption
source: A sequence option '{0}' is defined with fewer or more items than required.
de: Eine Sequenzoption '{0}' ist mit weniger oder mehr Elementen als erforderlich definiert.
pl: Wartość sekwencyjna '{0}' została zdefiniowana mniej razy, niż minimalna liczba wystąpień.

# CommandLineParser_SentenceSequenceOutOfRangeErrorValue
source: A sequence value not bound to option name is defined with few items than required.
de: Ein Sequenzwert, der nicht an den Optionsnamen gebunden ist, wird mit weniger Elementen als erforderlich definiert.
pl: Wartość sekwencyjna nieprzypisana do żadnej opcji została zdefiniowana mniej razy, niż minimalna liczba wystąpień.

# CommandLineParser_SentenceSetValueExceptionError
source: Error setting value to option '{0}': {1}
de: Fehler beim Setzen des Wertes für die Option '{0}': {1}
pl: Błąd przy ustawianiu wartośći opcji '{0}': {1}

# CommandLineParser_SentenceUnknownOptionError
source: Option '{0}' is unknown.
de: Die Option '{0}' ist unbekannt.
pl: Opcja '{0}' jest nieznana.

# CommandLineParser_SentenceUsageHeadingText
source: USAGE:
de: NUTZUNG:
pl: UŻYCIE:

# CommandLineParser_SentenceVersionCommandText
source: Display version information.
de: Zeigt Versionsinformationen an.
pl: Wyświetla informację o wersji.
